cf_billing/Reports/энргПредполагаемыеНачисленияАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>энргПредполагаемыеНачисленияАбонента</Name>
		</Properties>
	</Report>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргОплатаУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргОплатаУслуг</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчетыПоМесяцам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоМесяцам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргАвансы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргАвансы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/Reports/энргПредполагаемыеНачисленияАбонента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сформировывает отчет.
//
// Параметры:
//  ПараметрыОтчета	-	Структура:
	//* Период				-	Дата.
	//* ПериодНачисления	-	Дата.
	//* Абонент				-	СправочникСсылка.энргАбоненты.
//  АдресХранилища	-	Строка.
//
Процедура СформироватьОтчет(ПараметрыОтчета,АдресХранилища) Экспорт 
			
	РезультатОтчета 			= Новый ТабличныйДокумент;
	РезультатОтчета.НачатьАвтогруппировкуСтрок();
	ОбластиМакета  				= ОбластиМакета(ПараметрыОтчета);
	
	ВывестиДанныеАбонента(РезультатОтчета,ПараметрыОтчета,ОбластиМакета);	
	РезультатОтчета.ЗакончитьАвтогруппировкуСтрок();
	
	ПоместитьВоВременноеХранилище(РезультатОтчета,АдресХранилища);		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ВыводОтчета_СобытияАбонента

Процедура ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,Параметры)
	
	ОбластиМакета[ИмяОбласти].параметры.заполнить(Параметры);	
	
КонецПроцедуры

Процедура ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,Уровень)
	
	ТабДок.вывести(ОбластиМакета[ИмяОбласти],Уровень);	
	
КонецПроцедуры

Функция ВывестиДанныеАбонента(РезультатОтчета,ПараметрыОтчета,ОбластиМакета)
	Задолженность 							= 0;	
	
	Абонент  								= ПараметрыОтчета.Абонент;

	ДанныеЗаПериод 							= ВывестиНачальныеПоказатели(ПараметрыОтчета,ОбластиМакета,Задолженность);
	
	ИмяОбласти  							= "Шапка";
	Область  								= ОбластиМакета[ИмяОбласти];
	Область.Параметры.ПериодОтчета 			= Формат(ПараметрыОтчета.ПериодНачисления,"ДФ='ММММ гггг'");
	ВывестиОбластиВМакет(РезультатОтчета,ОбластиМакета,ИмяОбласти,0);
	
	ИмяОбласти  							= "ОбщаяЗадолженность";
	Область  								= ОбластиМакета[ИмяОбласти];
	Область.параметры.СуммаЗадолженности 	= Задолженность;					
	ВывестиОбластиВМакет(РезультатОтчета,ОбластиМакета,ИмяОбласти,0);
			
	РезультатОтчета.Вывести(ДанныеЗаПериод);

	Возврат РезультатОтчета;
	
КонецФункции

Функция ОбластиМакета(ПараметрыОтчета)
	                               
	Макет  						=  Отчеты.энргПредполагаемыеНачисленияАбонента.ПолучитьМакет("Макет");
	
	ОбластиМакета  				= Новый Структура;
	
	Области  					= Новый Массив;
	Области.Добавить("Шапка");
	Области.Добавить("ОбщаяЗадолженность");
	Области.Добавить("ПараметрыАбонента");
	Области.Добавить("Заголовок");
	Области.Добавить("ШапкаЗадолженностьПредыдущихПериодов");
	Области.Добавить("СтрокаЗадолженностьПредыдущихПериодов");
	Области.Добавить("ИтогоЗадолженностьПредыдущихПериодов");
	Области.Добавить("ШапкаПредполагаемыеНачисления");
	Области.Добавить("СтрокаПредполагаемыеНачисления");
	Области.Добавить("ИтогоПредполагаемыеНачисления");
	Области.Добавить("ШапкаПредполагаемыйПерерасчет");
	Области.Добавить("ПреполагаемыйПерерасчетСтрока");
	Области.Добавить("ИтогоПреполагаемыйПерерасчет");
	
	для Каждого ИмяОбласти из Области цикл
		 ОбластиМакета.Вставить("" +   ИмяОбласти,Макет.ПолучитьОбласть(ИмяОбласти));
	КонецЦикла; 
		
	Возврат ОбластиМакета;
КонецФункции

Функция РезультатЗапроса(Текст,ПараметрыОтчета)
	Запрос 		 		= Новый Запрос;
	Запрос.Текст 		= Текст;
	для Каждого ПараметрОтчета из ПараметрыОтчета цикл
		Запрос.УстановитьПараметр(ПараметрОтчета.Ключ,ПараметрОтчета.Значение);
	КонецЦикла;	
	Результат  			= Запрос.Выполнить();
	Возврат  Результат;
КонецФункции

Функция ВывестиНачальныеПоказатели(ПараметрыОтчета,ОбластиМакета,Задолженность)
	
	ТабДок  									= Новый ТабличныйДокумент;
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ПараметрыРасчета = Новый Структура("Организация, Район"); 
	энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(ПараметрыОтчета.Абонент, ПараметрыРасчета);
			
	ДанныеЗаполнения  							= Новый Структура("ДанныеАбонента");
	ДанныеЗаполнения.ДанныеАбонента  			= Новый Структура("Район,МКД,ЛицевойСчет,СтарыйЛС,ПредставлениеАбонента,АдресОбъекта,Строение,Помещение");
	энргРаботаСЛицевымСчетомСервер.ПараметрыРасчетаАбонента(ПараметрыРасчета.Организация, ПараметрыРасчета.Район, ПараметрыОтчета.Абонент,ПараметрыОтчета.Период,ДанныеЗаполнения);
	
	ИмяОбласти  								= "ПараметрыАбонента";
	Область  									= ОбластиМакета[ИмяОбласти];
	
	ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ДанныеЗаполнения.ДанныеАбонента);
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	ПараметрыЗапроса 							= Новый Структура("Район,Абонент,МКД,Период,Строение,Помещение");
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса,ДанныеЗаполнения.ДанныеАбонента);
	ПараметрыЗапроса.Период 					= ПараметрыОтчета.Период;
	ПараметрыЗапроса.Абонент 					= ПараметрыОтчета.Абонент;
		
	ИмяОбласти  								= "Заголовок";		
	Область  									= ОбластиМакета[ИмяОбласти];
	Область.Параметры.Заголовок 				= "Информация о задолженности абонента за прошлые периоды";
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	ИмяОбласти  								= "ШапкаЗадолженностьПредыдущихПериодов";		
	Область  									= ОбластиМакета[ИмяОбласти];
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	РезультатВзаиморасчеты 						= РезультатЗапроса(ТекстЗадолженностьАбонента(),ПараметрыЗапроса);
	ВыборкаВзаиморасчеты 						= РезультатВзаиморасчеты.выбрать();
	
	ИмяОбласти  								= "ИтогоЗадолженностьПредыдущихПериодов";		
	Область  									= ОбластиМакета[ИмяОбласти];
	
	Если ВыборкаВзаиморасчеты.следующий() тогда
		ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ВыборкаВзаиморасчеты);
		Задолженность 							= Задолженность + ВыборкаВзаиморасчеты.ИтогоСальдоДт - ВыборкаВзаиморасчеты.ИтогоСальдоКт;	
	КонецЕсли;
	              	
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	РезультатДеталиВзаиморасчеты 				= РезультатЗапроса(ТекстНачальныеДеталиВзаиморасчетов(),ПараметрыЗапроса);				  
	ВыборкаДеталиВзаиморасчеты 					= РезультатДеталиВзаиморасчеты.Выбрать();
	
	ИмяОбласти  								= "СтрокаЗадолженностьПредыдущихПериодов";		
	Область  									= ОбластиМакета[ИмяОбласти];
	
	Пока ВыборкаДеталиВзаиморасчеты.следующий() цикл
		 ЗаполнитьПараметрыОбласти(ОбластиМакета,ИмяОбласти,ВыборкаДеталиВзаиморасчеты);
		 ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,1);
	КонецЦикла;  	
	
	ИмяОбласти  								= "Заголовок";		
	Область  									= ОбластиМакета[ИмяОбласти];
	Область.Параметры.Заголовок 				= "Предполагаемые начисления за текущий период";
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	ИмяОбласти  								= "ШапкаПредполагаемыеНачисления";		
	Область  									= ОбластиМакета[ИмяОбласти];
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	ИмяОбласти  								= "СтрокаПредполагаемыеНачисления";		
	Область  									= ОбластиМакета[ИмяОбласти];
		
	ОписаниеДокумента  							= энргНачисления.ОписаниеДокументаНачисления("энргНачисление");
	ОписаниеДокументаПерерасчет 				= энргНачисления.ОписаниеДокументаНачисления("энргПерерасчет");
	
	энргНачисления.ВосстановитьПолседовательность(ПараметрыРасчета.Организация,ПараметрыОтчета.ПериодНачисления,ПараметрыРасчета.Район,ПараметрыЗапроса.Строение,ПараметрыЗапроса.Помещение);
	энргНачисления.Начислить(ПараметрыРасчета);
	энргНачисления.СнятьСредниеНачисления(ПараметрыРасчета, ОписаниеДокументаПерерасчет);//, ПараметрыЗапроса.Абонент,ОписаниеДокументаПерерасчет);

	ОтборПоАбоненту = Новый Структура("Абонент", ПараметрыОтчета.Абонент);
	ОбъемВсего = 0;
	СуммаВсего = 0;
	СписокСтрок = ОписаниеДокумента.ОбъемНачислений.НайтиСтроки(ОтборПоАбоненту);
	для Каждого СтрокаНачислений из СписокСтрок цикл
		//Область.параметры.Поставщик   			= "" + СтрокаНачислений.Поставщик + Символы.ПС + "(" + СтрокаНачислений.ВидОперации + ")";
		Область.параметры.Поставщик   			= "" + СтрокаНачислений.Поставщик;
		Область.параметры.ПериодРасчетов        = Формат(СтрокаНачислений.НачалоПериода,"ДФ='дд.ММ'") + "-" + Формат(СтрокаНачислений.КонецПериода,"ДФ='дд.ММ'");
		Область.параметры.Услуга                = СтрокаНачислений.Услуга;
		Область.параметры.ПриборУчета           = СокрЛП(Строка(СтрокаНачислений.ПриборУчета));
		Область.параметры.НачальныеПоказания    = СтрокаНачислений.НачальныеПоказания;
		Область.параметры.КонечныеПоказания     = СтрокаНачислений.КонечныеПоказания;
		Область.параметры.ЗначениеТарифа        = СтрокаНачислений.ЗначениеТарифа;
		Область.параметры.Сумма                 = СтрокаНачислений.Сумма;
		Область.параметры.ОбъемУслуги           = СтрокаНачислений.ОбъемУслуги;
		ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,1);		
		ОбъемВсего 								= ОбъемВсего + СтрокаНачислений.ОбъемУслуги;
		СуммаВсего 								= СуммаВсего + СтрокаНачислений.Сумма;		
	КонецЦикла; 
		
	ИмяОбласти  								= "ИтогоПредполагаемыеНачисления";		
	Область  									= ОбластиМакета[ИмяОбласти];
	Область.параметры.Сумма						= СуммаВсего;
	Область.параметры.ОбъемУслуги				= ОбъемВсего;
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	Задолженность 								= Задолженность + СуммаВсего;	
	
	ИмяОбласти  								= "Заголовок";		
	Область  									= ОбластиМакета[ИмяОбласти];
	Область.Параметры.Заголовок 				= "Данные перерасчета (в случае предоставления показаний)";
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);

	ИмяОбласти  								= "ШапкаПредполагаемыйПерерасчет";		
	Область  									= ОбластиМакета[ИмяОбласти];
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);

	ИмяОбласти  								= "ПреполагаемыйПерерасчетСтрока";		
	Область  									= ОбластиМакета[ИмяОбласти];
	
	ОбъемВсего 									= 0;
	СуммаВсего 									= 0;
	
	СписокСтрок = ОписаниеДокументаПерерасчет.ОбъемНачислений.НайтиСтроки(ОтборПоАбоненту);
	Для Каждого Строкаперерасчета из СписокСтрок цикл 		
		Область.Параметры.Поставщик 			= Строкаперерасчета.Поставщик;
		Область.Параметры.ПериодРасчетов        = Формат(Строкаперерасчета.ПериодНачисления,"ДФ='ММММ гггг'");
		Область.Параметры.Услуга                = Строкаперерасчета.Услуга;
		Область.Параметры.ПриборУчета           = СокрЛП(Строка(Строкаперерасчета.ПриборУчета));
		Область.Параметры.ЗначениеТарифа        = Строкаперерасчета.ЗначениеТарифа;
		Область.Параметры.Сумма                 = Строкаперерасчета.Сумма;
		Область.Параметры.ОбъемУслуги           = Строкаперерасчета.ОбъемУслуги;
		ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,1);
		ОбъемВсего 								= ОбъемВсего + Строкаперерасчета.ОбъемУслуги;
		СуммаВсего 								= СуммаВсего + Строкаперерасчета.Сумма;		
	КонецЦикла;	
	
	ИмяОбласти  								= "ИтогоПреполагаемыйПерерасчет";		
	Область  									= ОбластиМакета[ИмяОбласти];
	Область.параметры.Сумма 					= СуммаВсего;
	Область.параметры.ОбъемУслуги 				= ОбъемВсего;
	ВывестиОбластиВМакет(ТабДок,ОбластиМакета,ИмяОбласти,0);
	
	Задолженность 								= Задолженность + СуммаВсего;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	Возврат ТабДок;	
КонецФункции

Функция ТекстЗадолженностьАбонента()
	
	Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВложенныйЗАпрос.СуммаОстаток > 0
	|			ТОГДА ВложенныйЗАпрос.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИтогоСальдоДт,
	|	ВЫБОР
	|		КОГДА ВложенныйЗАпрос.СуммаОстаток < 0
	|			ТОГДА -ВложенныйЗАпрос.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ИтогоСальдоКт
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаРегистра.СуммаОстаток КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.энргВзаиморасчеты.Остатки(
	|				НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
	|				Район = &Район
	|					И МКД = &МКД
	|					И Абонент = &Абонент) КАК ТаблицаРегистра
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		-энргОплатаУслугОбороты.СуммаОборот
	|	ИЗ
	|		РегистрНакопления.энргОплатаУслуг.Обороты(
	|				НАЧАЛОПЕРИОДА(&Период, ДЕНЬ),
	|				&Период,
	|				,
	|				Район = &Район
	|					И Абонент = &Абонент
	|					И МКД = &МКД) КАК энргОплатаУслугОбороты) КАК ВложенныйЗАпрос";	
	Возврат  Текст;

КонецФункции

Функция ТекстНачальныеДеталиВзаиморасчетов()
	Текст 	= "ВЫБРАТЬ
	|	ТаблицаРегистра.Абонент,
	|	ТаблицаРегистра.ПериодНачисления КАК ПериодНачисления,
	|	ТаблицаРегистра.Поставщик,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Поставщик) КАК ПоставщикПредставление,
	|	ТаблицаРегистра.Услуга,
	|	ПРЕДСТАВЛЕНИЕ(ТаблицаРегистра.Услуга) КАК УслугаПредставление,
	|	ТаблицаРегистра.СуммаОстаток КАК СальдоДт,
	|	0 КАК СальдоКТ
	|ИЗ
	|	РегистрНакопления.энргВзаиморасчетыПоМесяцам.Остатки(
	|			&Период,
	|			Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК ТаблицаРегистра
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаРегистра.Абонент,
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка),
	|	"""",
	|	ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка),
	|	"""",
	|	0,
	|	ТаблицаРегистра.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.энргАвансы.Остатки(
	|			&Период,
	|			Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК ТаблицаРегистра";
		
	Возврат Текст;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
